export const clients: string[] = [
  "/assets/images/client.webp",
  "/assets/images/client.webp",
  "/assets/images/client.webp",
  "/assets/images/client.webp",
   "/assets/images/client.webp",
    "/assets/images/client.webp",
     "/assets/images/client.webp",
      "/assets/images/client.webp",
      "/assets/images/client.webp",
];

export const heroSlides = [
  {
    image: '/assets/images/slide1.webp',
    subtitle: 'Best Products',
    arSubtitle: 'أفضل المنتجات',
    title: 'Power Distribution Panels',
    arTitle: 'لوحات توزيع الطاقة'
  },
  {
    image: '/assets/images/slide2.webp',
    subtitle: 'Best Products',
    arSubtitle: 'أفضل المنتجات',
    title: 'Control & Automation Panels',
    arTitle: 'لوحات التحكم والأتمتة'
  }
];

export const textSlides = [
  {
    text: 'Panel Manufacturing Services',
    arText: 'خدمات تصنيع اللوحات'
  },
  {
    text: 'Installation & Commissioning',
    arText: 'التركيب والتشغيل'
  },
  {
    text: 'Repair & Servicing',
    arText: 'الإصلاح والصيانة'
  },
  {
    text: 'Preventive Maintenance & AMC',
    arText: 'الصيانة الوقائية وعقود الصيانة'
  },
  {
    text: 'Panel Modification & Upgradation',
    arText: 'تعديل وتحديث اللوحات'
  },
  {
    text: 'Automation & Programming Services',
    arText: 'خدمات الأتمتة والبرمجة'
  }
];

export const products = [
  {
    title: 'Power Distribution Panels',
    arTitle: 'لوحات توزيع الطاقة',
    subtitle: 'Main Switch Boards (MSB)',
    arSubtitle: 'لوحات المفاتيح الرئيسية',
    img: '/assets/images/product1.webp'
  },
  {
    title: 'Control & Automation Panels',
    arTitle: 'لوحات التحكم والأتمتة',
    subtitle: 'Motor Control Panels',
    arSubtitle: 'لوحات التحكم بالمحركات',
    img: '/assets/images/product2.webp'
  },
  {
    title: 'Generator & Transfer Panels',
    arTitle: 'لوحات المولدات والتحويل',
    subtitle: 'Automatic Transfer Switch (ATS) Panels',
    arSubtitle: 'لوحات التحويل التلقائي',
    img: '/assets/images/product3.webp'
  },
   {
    title: 'Generator & Transfer Panels',
    arTitle: 'لوحات المولدات والتحويل',
    subtitle: 'Automatic Transfer Switch (ATS) Panels',
    arSubtitle: 'لوحات التحويل التلقائي',
    img: '/assets/images/product3.webp'
  },
];

export const services = [
  {
    title: 'Panel Manufacturing Services',
    arTitle: 'خدمات تصنيع اللوحات',
    descriapation: 'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout',
    arDescripation: 'من المعروف أن القارئ سيتشتت بسبب المحتوى المقروء لصفحة ما عند النظر إلى تخطيطها',
    img: '/assets/images/service1.webp'
  },
  {
    title: 'Installation & Commissioning',
    arTitle: 'التركيب والتشغيل',
    descriapation: 'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout',
    arDescripation: 'من المعروف أن القارئ سيتشتت بسبب المحتوى المقروء لصفحة ما عند النظر إلى تخطيطها',
    img: '/assets/images/service2.webp'
  },
  {
    title: 'Repair & Servicing',
    arTitle: 'الإصلاح والصيانة',
    descriapation:'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout',
    arDescripation:'من المعروف أن القارئ سيتشتت بسبب المحتوى المقروء لصفحة ما عند النظر إلى تخطيطها',
    img: '/assets/images/service3.webp'
  },
  {
    title: 'Preventive Maintenance & AMC',
    arTitle: 'الصيانة الوقائية وعقود الصيانة',
   descriapation:'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout',
    arDescripation:'من المعروف أن القارئ سيتشتت بسبب المحتوى المقروء لصفحة ما عند النظر إلى تخطيطها',
    img: '/assets/images/service4.webp'
  },
  {
    title: 'Panel Modification & Upgradation',
    arTitle: 'تعديل وتحديث اللوحات',
    descriapation:'It is a long established fact that a reader will be distracted by the readable content of a page when looking at its layout',
    arDescripation:'من المعروف أن القارئ سيتشتت بسبب المحتوى المقروء لصفحة ما عند النظر إلى تخطيطها',
    img: '/assets/images/service5.webp'
  }
];

export const featuresData = {
  en: [
    {
      id: 1,
      title: "Worldwide Manufacturing",
      description: "Industry's standard dummy text ever since the when an printer took a galley of type and scrambled",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50" fill="none"><path d="M25 50C11.1929 50 0 38.8071 0 25C0 11.1929 11.1929 0 25 0C38.8071 0 50 11.1929 50 25C50 38.8071 38.8071 50 25 50ZM25 47.9167C37.6565 47.9167 47.9167 37.6565 47.9167 25C47.9167 12.3435 37.6565 2.08333 25 2.08333C12.3435 2.08333 2.08333 12.3435 2.08333 25C2.08333 37.6565 12.3435 47.9167 25 47.9167Z" fill="white"></path><path d="M44.5815 35.5139L46.2407 37.129L47.6938 35.6361L45.6161 33.6136C45.3561 33.3605 44.9831 33.261 44.6316 33.3508L39.5617 34.6467C38.8858 34.8195 38.5674 35.5949 38.927 36.1928L42.3769 41.9296L44.1623 40.8559L41.4337 36.3186L44.5815 35.5139Z" fill="white"></path></svg>`,
      delay: ".3s"
    },
    {
      id: 2,
      title: "Best Quality Service",
      description: "The point of using Lorem Ipsum is that it has a more-or less normal distribution of letters",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="40" height="55" viewBox="0 0 40 55" fill="none"><path d="M11.9206 54.3715C11.6594 54.3717 11.403 54.3004 11.1794 54.1654C10.9557 54.0303 10.7733 53.8367 10.6518 53.6054L8.55811 49.617L4.27048 50.9875C4.0089 51.0716 3.72866 51.0786 3.46321 51.0077C3.19775 50.9369 2.95828 50.7912 2.77335 50.588C2.58842 50.3848 2.46585 50.1327 2.42025 49.8618C2.37465 49.5908 2.40796 49.3125 2.51618 49.06L8.62685 34.7492C8.77593 34.3998 9.05771 34.1239 9.4102 33.9822C9.76269 33.8406 10.157 33.8447 10.5065 33.9938C10.8559 34.1429 11.1318 34.4247 11.2734 34.7771C11.4151 35.1296 11.4109 35.524 11.2619 35.8734L6.37993 47.3057L8.83021 46.5238C9.15112 46.4207 9.4981 46.4341 9.81008 46.5617C10.1221 46.6893 10.379 46.9228 10.5358 47.2212L11.7846 49.5998L17.0231 37.284C17.0932 37.106 17.1982 36.9438 17.332 36.8071C17.4658 36.6704 17.6256 36.5618 17.802 36.4879C17.9784 36.4139 18.1679 36.3761 18.3592 36.3765C18.5505 36.377 18.7397 36.4158 18.9158 36.4906C19.0918 36.5654 19.2511 36.6748 19.3842 36.8122C19.5173 36.9496 19.6216 37.1122 19.6907 37.2906C19.7599 37.4689 19.7927 37.6593 19.7871 37.8505C19.7815 38.0417 19.7377 38.2299 19.6581 38.4039L13.2367 53.4994C13.1308 53.7485 12.9565 53.9625 12.734 54.1167C12.5115 54.2708 12.2498 54.3586 11.9793 54.3701L11.9206 54.3715Z" fill="white"></path></svg>`,
      delay: ".5s"
    },
    {
      id: 3,
      title: "Experienced Workers",
      description: "The point of using Lorem Ipsum is that it has a more-or less normal distribution of letters",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="50" height="57" viewBox="0 0 50 57" fill="none"><path d="M48.5385 39.3089C48.5359 39.3089 48.5334 39.308 48.5301 39.308L46.8333 39.0476C46.6317 38.3942 46.3713 37.7717 46.0547 37.1871L47.0677 35.8138C47.5784 35.1309 47.5103 34.1632 46.9072 33.5618L45.4642 32.1263C44.8737 31.5039 43.9043 31.4241 43.2105 31.9398L41.8279 32.9579C41.2198 32.6328 40.5949 32.3749 39.9615 32.1851L39.7045 30.4984C39.5861 29.6551 38.8503 29.0193 37.9926 29.0193H35.9448C35.1015 29.0193 34.3808 29.6282 34.2254 30.4951L33.9793 32.1885C33.7088 32.2708 33.4551 32.3623 33.2124 32.4656C33.0923 32.5018 32.9822 32.5454 32.9192 32.5799C32.6504 32.6866 32.3808 32.8117 32.1137 32.9545L30.7303 31.9356C30.0373 31.4325 29.0696 31.5123 28.4901 32.1095L27.0462 33.5542C26.6744 33.9149 26.5049 34.4126 26.5402 34.9019C26.153 34.8502 25.7644 34.814 25.3746 34.792V31.3561C28.2412 29.1645 30.0571 25.3974 30.2539 21.2647H31.3602C32.7874 21.2647 33.949 20.103 33.949 18.6759V17.8031C33.949 16.4311 32.8721 15.3162 31.521 15.2314C31.178 10.3964 27.9129 6.28097 23.2688 4.86426V2.51571C23.2688 1.12892 22.1399 0 20.7531 0H18.8985C17.5117 0 16.3828 1.12892 16.3828 2.51571V4.86426C11.7387 6.28097 8.47356 10.3964 8.13059 15.2314C6.7795 15.3162 5.70255 16.4311 5.70255 17.8031V18.6759C5.70255 20.103 6.86423 21.2647 8.29133 21.2647H9.37983C9.57691 25.4077 11.4164 29.1938 14.2744 31.3655V34.8076C6.33153 35.2509 0 41.8376 0 49.8942V53.1028C0 55.123 1.64382 56.7668 3.66479 56.7668H10.6635C10.6664 56.7668 10.6689 56.7685 10.6718 56.7685C10.6747 56.7685 10.6772 56.7668 10.6802 56.7668H29.8937C29.8967 56.7668 29.8991 56.7685 29.9021 56.7685C29.905 56.7685 29.9075 56.7668 29.9104 56.7668H35.9792C37.5564 56.7668 38.9665 55.7321 39.4476 54.2383C39.5668 54.0463 39.6621 53.8357 39.7028 53.5942L39.9624 51.8983C40.6091 51.7001 41.2307 51.4439 41.8195 51.1314L43.2189 52.1587C43.9144 52.6568 44.8804 52.572 45.444 51.9765L46.919 50.5183C47.3877 50.0336 47.5364 49.3415 47.3079 48.7359C47.26 48.5771 47.1802 48.4209 47.071 48.2739L46.0538 46.8946C46.3713 46.3041 46.6326 45.6817 46.8325 45.0349L48.5217 44.7771C49.365 44.6561 50 43.9237 50 43.0736V41.0182C50 40.1799 49.3717 39.445 48.5385 39.3089Z" fill="white"></path></svg>`,
      delay: ".7s"
    }
  ],
  ar: [
    {
      id: 1,
      title: "التصنيع العالمي",
      description: "النص القياسي للصناعة منذ أن أخذت طابعة معرض من النوع وخلطته",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="50" height="50" viewBox="0 0 50 50" fill="none"><path d="M25 50C11.1929 50 0 38.8071 0 25C0 11.1929 11.1929 0 25 0C38.8071 0 50 11.1929 50 25C50 38.8071 38.8071 50 25 50ZM25 47.9167C37.6565 47.9167 47.9167 37.6565 47.9167 25C47.9167 12.3435 37.6565 2.08333 25 2.08333C12.3435 2.08333 2.08333 12.3435 2.08333 25C2.08333 37.6565 12.3435 47.9167 25 47.9167Z" fill="white"></path><path d="M44.5815 35.5139L46.2407 37.129L47.6938 35.6361L45.6161 33.6136C45.3561 33.3605 44.9831 33.261 44.6316 33.3508L39.5617 34.6467C38.8858 34.8195 38.5674 35.5949 38.927 36.1928L42.3769 41.9296L44.1623 40.8559L41.4337 36.3186L44.5815 35.5139Z" fill="white"></path></svg>`,
      delay: ".3s"
    },
    {
      id: 2,
      title: "أفضل خدمة جودة",
      description: "الهدف من استخدام لوريم إيبسوم هو أن لديه توزيع طبيعي أكثر أو أقل من الحروف",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="40" height="55" viewBox="0 0 40 55" fill="none"><path d="M11.9206 54.3715C11.6594 54.3717 11.403 54.3004 11.1794 54.1654C10.9557 54.0303 10.7733 53.8367 10.6518 53.6054L8.55811 49.617L4.27048 50.9875C4.0089 51.0716 3.72866 51.0786 3.46321 51.0077C3.19775 50.9369 2.95828 50.7912 2.77335 50.588C2.58842 50.3848 2.46585 50.1327 2.42025 49.8618C2.37465 49.5908 2.40796 49.3125 2.51618 49.06L8.62685 34.7492C8.77593 34.3998 9.05771 34.1239 9.4102 33.9822C9.76269 33.8406 10.157 33.8447 10.5065 33.9938C10.8559 34.1429 11.1318 34.4247 11.2734 34.7771C11.4151 35.1296 11.4109 35.524 11.2619 35.8734L6.37993 47.3057L8.83021 46.5238C9.15112 46.4207 9.4981 46.4341 9.81008 46.5617C10.1221 46.6893 10.379 46.9228 10.5358 47.2212L11.7846 49.5998L17.0231 37.284C17.0932 37.106 17.1982 36.9438 17.332 36.8071C17.4658 36.6704 17.6256 36.5618 17.802 36.4879C17.9784 36.4139 18.1679 36.3761 18.3592 36.3765C18.5505 36.377 18.7397 36.4158 18.9158 36.4906C19.0918 36.5654 19.2511 36.6748 19.3842 36.8122C19.5173 36.9496 19.6216 37.1122 19.6907 37.2906C19.7599 37.4689 19.7927 37.6593 19.7871 37.8505C19.7815 38.0417 19.7377 38.2299 19.6581 38.4039L13.2367 53.4994C13.1308 53.7485 12.9565 53.9625 12.734 54.1167C12.5115 54.2708 12.2498 54.3586 11.9793 54.3701L11.9206 54.3715Z" fill="white"></path></svg>`,
      delay: ".5s"
    },
    {
      id: 3,
      title: "عمال ذوي خبرة",
      description: "الهدف من استخدام لوريم إيبسوم هو أن لديه توزيع طبيعي أكثر أو أقل من الحروف",
      icon: `<svg xmlns="http://www.w3.org/2000/svg" width="50" height="57" viewBox="0 0 50 57" fill="none"><path d="M48.5385 39.3089C48.5359 39.3089 48.5334 39.308 48.5301 39.308L46.8333 39.0476C46.6317 38.3942 46.3713 37.7717 46.0547 37.1871L47.0677 35.8138C47.5784 35.1309 47.5103 34.1632 46.9072 33.5618L45.4642 32.1263C44.8737 31.5039 43.9043 31.4241 43.2105 31.9398L41.8279 32.9579C41.2198 32.6328 40.5949 32.3749 39.9615 32.1851L39.7045 30.4984C39.5861 29.6551 38.8503 29.0193 37.9926 29.0193H35.9448C35.1015 29.0193 34.3808 29.6282 34.2254 30.4951L33.9793 32.1885C33.7088 32.2708 33.4551 32.3623 33.2124 32.4656C33.0923 32.5018 32.9822 32.5454 32.9192 32.5799C32.6504 32.6866 32.3808 32.8117 32.1137 32.9545L30.7303 31.9356C30.0373 31.4325 29.0696 31.5123 28.4901 32.1095L27.0462 33.5542C26.6744 33.9149 26.5049 34.4126 26.5402 34.9019C26.153 34.8502 25.7644 34.814 25.3746 34.792V31.3561C28.2412 29.1645 30.0571 25.3974 30.2539 21.2647H31.3602C32.7874 21.2647 33.949 20.103 33.949 18.6759V17.8031C33.949 16.4311 32.8721 15.3162 31.521 15.2314C31.178 10.3964 27.9129 6.28097 23.2688 4.86426V2.51571C23.2688 1.12892 22.1399 0 20.7531 0H18.8985C17.5117 0 16.3828 1.12892 16.3828 2.51571V4.86426C11.7387 6.28097 8.47356 10.3964 8.13059 15.2314C6.7795 15.3162 5.70255 16.4311 5.70255 17.8031V18.6759C5.70255 20.103 6.86423 21.2647 8.29133 21.2647H9.37983C9.57691 25.4077 11.4164 29.1938 14.2744 31.3655V34.8076C6.33153 35.2509 0 41.8376 0 49.8942V53.1028C0 55.123 1.64382 56.7668 3.66479 56.7668H10.6635C10.6664 56.7668 10.6689 56.7685 10.6718 56.7685C10.6747 56.7685 10.6772 56.7668 10.6802 56.7668H29.8937C29.8967 56.7668 29.8991 56.7685 29.9021 56.7685C29.905 56.7685 29.9075 56.7668 29.9104 56.7668H35.9792C37.5564 56.7668 38.9665 55.7321 39.4476 54.2383C39.5668 54.0463 39.6621 53.8357 39.7028 53.5942L39.9624 51.8983C40.6091 51.7001 41.2307 51.4439 41.8195 51.1314L43.2189 52.1587C43.9144 52.6568 44.8804 52.572 45.444 51.9765L46.919 50.5183C47.3877 50.0336 47.5364 49.3415 47.3079 48.7359C47.26 48.5771 47.1802 48.4209 47.071 48.2739L46.0538 46.8946C46.3713 46.3041 46.6326 45.6817 46.8325 45.0349L48.5217 44.7771C49.365 44.6561 50 43.9237 50 43.0736V41.0182C50 40.1799 49.3717 39.445 48.5385 39.3089Z" fill="white"></path></svg>`,
      delay: ".7s"
    }
  ]
}
